[
    {
        "name": "Power Partials",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "dumbbell",
        "difficulty": "beginner",
        "instructions": "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso. The palms of the hands should be facing your torso. Your feet should be about shoulder width apart. This will be your starting position. Keeping your arms straight and the torso stationary, lift the weights out to your sides until they are about shoulder level height while exhaling. Feel the contraction for a second and begin to lower the weights back down to the starting position while inhaling. Tip: Keep the palms facing down with the little finger slightly higher while lifting and lowering the weights as it will concentrate the stress on your shoulders mainly. Repeat for the recommended amount of repetitions.  Variations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc."
    },
    {
        "name": "Snatch-Grip Behind-The-Neck Press",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "barbell",
        "difficulty": "beginner",
        "instructions": "Load a barbell about chest level in a squat rack making sure the apparatus doesn’t impede your hand placement. Take a very wide grip on the bar equidistant from the midpoint and place it on your traps as if you were doing a squat. Step back from the rack using a shoulder-width stance, feet angled slightly outward, with your knees unlocked and torso upright while maintaining a big chest with your shoulders back. Keep your head facing forward throughout. Lift the bar off your traps; this will be your starting position. Keeping your elbows under the bar, press the bar overhead to full arm extension and lower under control without overextending your shoulders and leaning your head forward just a bit. Repeat for reps."
    },
    {
        "name": "Two-Arm Kettlebell Military Press",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "kettlebells",
        "difficulty": "beginner",
        "instructions": "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you swing the kettlebells towards your shoulders. Rotate your wrists as you do so, so that the palms face forward. Press the kettlebells up and out. As the kettlebells pass your head, lean into the weights so that the kettlebells are racked behind your head. Make sure to contract your lats, butt, and stomach for added stability."
    },
    {
        "name": "Alternating Kettlebell Press",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "kettlebells",
        "difficulty": "beginner",
        "instructions": "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. Press one directly overhead by extending through the elbow, turning it so the palm faces forward while holding the other kettlebell stationary . Lower the pressed kettlebell to the starting position and immediately press with your other arm."
    },
    {
        "name": "Cable Internal Rotation",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "cable",
        "difficulty": "beginner",
        "instructions": "Sit next to a low pulley sideways (with legs stretched in front of you or crossed) and grasp the single hand cable attachment with the arm nearest to the cable. Tip: If you can adjust the pulley’s height, you can use a flat bench to sit on instead. Position the elbow against your side with the elbow bent at 90° and the arm pointing towards the pulley. This will be your starting position. Pull the single hand cable attachment toward your body by internally rotating your shoulder until your forearm is across your abs. You will be creating an imaginary semi-circle. Tip: The forearm should be perpendicular to your torso at all times. Slowly go back to the initial position. Repeat for the recommended amount of repetitions and then repeat the movement with the next arm.  Caution: Do not use heavy weights for this exercise as if you use too much you risk rotator cuff injury. Variations: You can use dumbbells for this movement as well as exercise bands."
    },
    {
        "name": "Side Wrist Pull",
        "type": "stretching",
        "muscle": "shoulders",
        "equipment": "none",
        "difficulty": "beginner",
        "instructions": "This stretch works best standing. Cross your left arm over the midline of your body and hold the left wrist in your right hand down at the level of your hips. Start the stretch with a bent left arm. Slowly straighten, pull, and lift it up to shoulder height, as pictured. Feel this stretch originate in your back, not your shoulders, and don't pull too hard on the shoulders joint. Switch sides."
    },
    {
        "name": "Dumbbell Raise",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "dumbbell",
        "difficulty": "beginner",
        "instructions": "Grab a dumbbell in each arm and stand up straight with your arms extended by your sides with a slight bend at the elbows and your back straight. This will be your starting position. Tip: The dumbbell should be next to your thighs with the palm of your hands facing back. Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be to the side of the body as you move them up. Continue to lift it until the dumbbells are nearly in line with your chin. Tip: Your elbows should drive the motion. As you lift the dumbbell, your elbow should always be higher than your forearm. Also, keep your torso stationary and pause for a second at the top of the movement. Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions.  Caution: Be very careful with how much weight you use in this exercise. Too much weight leads to bad form, which in turn can cause shoulder injury. I've seen this too many times so please no jerking, swinging and cheating. Also, if you suffer from shoulder problems, you may want to stay away from this movement and substitute by some form of lateral raises. Variations: This exercise can also be performed using a straight bar attached to a low pulley and it can also be performed using an e-z bar, cables and exercise band."
    },
    {
        "name": "Internal Rotation with Band",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "bands",
        "difficulty": "beginner",
        "instructions": "Choke the band around a post. The band should be at the same height as your elbow. Stand with your right side to the band a couple of feet away. Grasp the end of the band with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position. With your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching away from your torso. This will be your starting position. Execute the movement by rotating your arm in a forehand motion, keeping your elbow in place. Continue as far as you are able, pause, and then return to the starting position."
    },
    {
        "name": "Bradford/Rocky Presses",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "barbell",
        "difficulty": "beginner",
        "instructions": "Sit on a Military Press Bench with a bar at shoulder level with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down. This is your starting position. Once you pick up the barbell with the correct grip, lift the bar up over your head by locking your arms. Now lower the bar down to the back of the head slowly as you inhale. Lift the bar back up to the starting position as you exhale. Lower the bar down to the starting position slowly as you inhale. This is one repetition. Alternate in this manner until you complete the recommended amount of repetitions.  Variations: For more stress on the shoulders, only lift the bar until it is slightly above the head and then lower to the opposite side. In this manner you keep more constant tension on the shoulders while minimizing triceps involvement."
    },
    {
        "name": "Cable Shoulder Press",
        "type": "strength",
        "muscle": "shoulders",
        "equipment": "cable",
        "difficulty": "beginner",
        "instructions": "Move the cables to the bottom of the towers and select an appropriate weight. Stand directly in between the uprights. Grasp the cables and hold them at shoulder height, palms facing forward. This will be your starting position. Keeping your head and chest up, extend through the elbow to press the handles directly over head. After pausing at the top, return to the starting position and repeat."
    }
]